windtryTrue/0.orig/air/PMV
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      PMV;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;//1.40936=302;-1.18438;=290

boundaryField
{
	inlet
    {
        type            calculated;
        value           $internalField;
    }

    ourlet
    {
        type            calculated;
        value          $internalField;
    }

    top
    {
        type            calculated;
        value           $internalField;//16.61=0.2m/s
    }

    side
    {
        type            calculated;
        value          $internalField;
    }


    air_to_floor
    {
        type            calculated;
        value           $internalField;
    }

}


// ************************************************************************* //
