windtryTrue/0.orig/air/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.001308731;

boundaryField
{
    #include            "include/ABLConditions"
    maxY
    {
        type            zeroGradient;
    }

    outlet
    {
        type            inletOutlet;
        value          	$internalField;
        inletValue      $internalField;
    }

    inlet
    {
        type            atmBoundaryLayerInletEpsilon;
        #include        "include/ABLConditions"
    }

    side
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }
	"conditioner.*"
	{
		type            fixedValue;
		value           $internalField;
    }
    air_to_floor
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.4;
        value           $internalField;
    }
}


// ************************************************************************* //
