windtryTrue/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         36000;

deltaT          1;

writeControl    adjustableRunTime;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo          250;

maxDeltaT       10;

maxDi           0.25;

libs ("libatmosphericModels.so");
functions
{
#includeFunc	cellMaxAirT
//#includeFunc	cellMaxSolidT
#includeFunc	volAvgAirT
//#includeFunc	volAvgSolidT
//#includeFunc	volAvgInterface

//#includeFunc	streamlines
#includeFunc 	solverInfo
#include 		"FOage"
#include 		"FOcomfort"
}
// ************************************************************************* //
